//Задача 21
//Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
 
//A (3,6,8); B (2,1,-7), -> 15.84
//A (7,-5, 0); B (1,-1,9) -> 11.53
 
// ------------------------------------------------------------------------------------------------
int X1, X2, Y1, Y2, Z1, Z2;
double result;
// ------------------------------------------------------------------------------------------------
X1 = Koords("Введите координату X1 числа А: ");
X2 = Koords("Введите координату X2 числа B: ");
Y1 = Koords("Введите координату Y1 числа A: ");
Y2 = Koords("Введите координату Y2 числа B: ");
Z1 = Koords("Введите координату Z1 числа A: ");
Z2 = Koords("Введите координату Z2 числа B: ");
 
result = Distanse (X1, X2, Y1, Y2, Z1, Z2);
Console.Write ("-> " + result);
    
// ------------------------------------------------------------------------------------------------
static int Koords(string message)
{
    Console.Write(message);
    int result = int.Parse(Console.ReadLine() ?? "");
    return result;
}
 
static double Distanse(int X1, int X2, int Y1, int Y2, int Z1, int Z2)
{
    double result = Math.Sqrt(Math.Pow(X2 - X1, 2) + Math.Pow(Y2 - Y1, 2) + Math.Pow(Z2 - Z1, 2));
    return result;
} 

 
 
 

    